# GetApplicableDemandFactor Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorDefinition..::..GetApplicableDemandFactor Method
ElectricalDemandFactorDefinition Class See Also
---
This method will return the applicable demand factor for the specified number of devices or load.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double GetApplicableDemandFactor(
	double numberOrLoad
)
```

Visual Basic
---
```text
Public Function GetApplicableDemandFactor ( _
	numberOrLoad As Double _
) As Double
```

Visual C++
---
```text
public:
double GetApplicableDemandFactor(
	double numberOrLoad
)
```

# ### Parameters
numberOrLoad
    Type: System..::..Double The number of devices or load for which the demand factor should be looked up.
# ### Return Value
The applicable demand factor.
# See Also
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace